#### Terragrunt Plan 📖 (infra/prod) `success`

<details><summary>Show Plan</summary>

```
06:37:17.410 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
06:37:17.410 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
06:37:17.410 STDOUT tofu:   + create
06:37:17.410 STDOUT tofu: OpenTofu will perform the following actions:
06:37:17.410 STDOUT tofu:   # google_storage_bucket.auto-expire will be created
06:37:17.410 STDOUT tofu:   + resource "google_storage_bucket" "auto-expire" {
06:37:17.410 STDOUT tofu:       + effective_labels            = {
06:37:17.411 STDOUT tofu:           + "goog-terraform-provisioned" = "true"
06:37:17.411 STDOUT tofu:         }
06:37:17.411 STDOUT tofu:       + force_destroy               = true
06:37:17.411 STDOUT tofu:       + id                          = (known after apply)
06:37:17.411 STDOUT tofu:       + location                    = "US"
06:37:17.411 STDOUT tofu:       + name                        = "thr-no-publisdfdsfghafc-accdfgess-bucket"
06:37:17.411 STDOUT tofu:       + project                     = "psyched-circuit-405312"
06:37:17.411 STDOUT tofu:       + project_number              = (known after apply)
06:37:17.411 STDOUT tofu:       + public_access_prevention    = "enforced"
06:37:17.411 STDOUT tofu:       + rpo                         = (known after apply)
06:37:17.411 STDOUT tofu:       + self_link                   = (known after apply)
06:37:17.411 STDOUT tofu:       + storage_class               = "STANDARD"
06:37:17.411 STDOUT tofu:       + terraform_labels            = {
06:37:17.411 STDOUT tofu:           + "goog-terraform-provisioned" = "true"
06:37:17.411 STDOUT tofu:         }
06:37:17.411 STDOUT tofu:       + time_created                = (known after apply)
06:37:17.411 STDOUT tofu:       + uniform_bucket_level_access = (known after apply)
06:37:17.411 STDOUT tofu:       + updated                     = (known after apply)
06:37:17.411 STDOUT tofu:       + url                         = (known after apply)
06:37:17.411 STDOUT tofu:       + soft_delete_policy (known after apply)
06:37:17.411 STDOUT tofu:       + versioning (known after apply)
06:37:17.411 STDOUT tofu:       + website (known after apply)
06:37:17.411 STDOUT tofu:     }
06:37:17.411 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
06:37:17.411 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
06:37:17.412 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
06:37:17.412 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

*Pusher: @muralisathenapally, Directory: `infra/prod`*